//=====================================================
// 戳戳樂設定檔
//=====================================================

// 對話框的標題字
title = '戳戳樂';

// 字型與字的大小
font = '標楷體';
fontsize = 64;

// 是否在格子的左上角顯示格子的編號
showNumber = 0;

//
// 戳洞時的音效，預設的音效為南投縣永興國小江明勳老師提供
//
//soundFilename = '20100412-poke-1.mp3';
//
// MP3 base64 encode tools
// 		https://codepen.io/xewl/pen/NjyRJx
//
//
soundFilename = 'AOI.mp3';

// paper 圖檔的目錄路徑(相對於程式所在的目錄)
mediaFolder = 'data';

//
// 每一洞上可使用的圖檔檔名，以半形逗號分隔不同的檔名
// 預設的小精靈圖案取自 openclipart (https://openclipart.org/)
//
paper = 'alien.png,angel.png,base.png,billy.png,borg.png,bricky.png,camouflage.png,candy.png,chef.png';

// 每一格的黑色外框線粗細大小
blackborder = 2

// 要設計幾欄幾列的戳戳樂
col = 5;	//一橫排放幾格
row = 5;	//一直排放幾格

//
// 題庫
//
//每對引號中的即是一個問題的設定
//每一個項目中以「半形逗號」當欄位分隔符號
//  第一欄是選中以後要顯示的內容
//  第二欄是該題要出現的次數(如果沒有此欄設定，則預設出現一次)
//
//第一欄中可以利用「半形井字號」當分隔，可放入不同的素材
//  目前支援的素材有：文字、圖片檔或是聲音檔(.mp3)
//
question = new Array(
//------------------------------------下一行開始增加題目
 '限制酶？DNA連接酶？,1'
,'載體？目標基因？,1'
,'胰島素基因？人類胰島素？,1'
,'病毒DNA？質體？,1'
,'轉殖抗蟲基因？轉殖胰島素基因？,1'
,'食品安全？基因擴散？,1'
,'社會倫理？食品安全？,1'
,'神創論？天擇說？,1'
,'過度繁殖？遺傳變異？,1'
,'遺傳變異？生存競爭？,1'
,'環境？用進廢退？,1'
,'正確？錯誤？,1'
,'親緣關係？細胞構造？,1'
,'同源構造？化石？,1'
,'同源構造？化石？,1'
,'分子生物學？生物地理學？,1'
,'分子生物學？生物地理學？,1'
,'用進廢退？共同祖先？,1'
,'葡萄糖？蛋白質？,1'
,'界？種？,1'
,'二氧化碳？氧？,1'
,'有利？不利？,1'
,'鳥類？鱷魚類？#tree.jpg,1'
,'「」是正確的嗎？正確？錯誤？,1'
,最帥生物老師的名字是？,1'

//------------------------------------題庫結束,以下請勿修改
);
